<?php
/*
 * Вывод пирамидок на PHP
 */

/* Задача 1
 * Вывести на экран :
 *
xx
xxxx
xxxxxx
xxxxxxxx
xxxxxxxxxx
 */

$str = 'x';

for ($i = 0; $i < 6; $i++) {
    $str = $str . 'xx';
    echo $str . "<br>" ;

}


echo "<br>" . "<hr>";

/* Задача 2
 * Вывести следующую пирамидку
1
333
55555
7777777
999999999
 */

for ($i = 1; $i <= 9; $i+=2) {
    for ($j = 1; $j <= $i; $j++) {
            echo $i;
    }
    echo "<br>";
}


/*
 * Перевернутые пирамидки
 */

echo "<br>" . "<hr>";
/* Задача 3
 * Выведите на экран следующую пирамидку:
xxxxxxxxxx
xxxxxxxx
xxxxxx
xxxx
xx
 */

for ($i = 5; $i >= 1; $i--) {
    $str = '';

    for ($j = 0; $j < $i; $j++) {
        $str .= 'xx';
    }

    echo $str . '<br>';
}


echo "<br>" . "<hr>";
/* Задача 4
 * Выведите на экран следующую пирамидку:
999999999
88888888
7777777
666666
55555
4444
333
22
1
 */

for ($i = 9; $i >= 1; $i--) {
    for($j = 0; $j <$i ; $j++) {
        echo $i;
    }
    echo "<br>";
}