<?php
/*
 * Чтение и запись файла в PHP
 */

/* Задача 1
 * Пусть у вас есть файлы 1.txt и 2.txt, в тексте которых записаны какие-то числа.
 * Напишите скрипт, который выведет на экран сумму записанных в этих файлах чисел.
 */

/* Задача 2
 * Дан массив с числами. Найдите сумму этих чисел и результат запишите в файл sum.txt.
 */

/* Задача 3
 *  Пусть у вас есть файл, в котором записано некоторое число.
 * Откройте этот файл, возведите число в квадрат и запишите обратно в файл.
 */

/* Задача 4
 * Пусть в корне вашего сайта лежит файл count.txt. Изначально в нем записано число 0.
 * Сделайте так, чтобы при обновлении страницы наш скрипт каждый раз увеличивал это число на 1.
 * То есть у нас получится счетчик обновления страницы в виде файла.
 */

/* Задача 5
 * Пусть в корне вашего сайта лежат файлы 1.txt, 2.txt и 3.txt. Вручную сделайте
 * массив с именами этих файлов. .Переберите его циклом, прочитайте содержимое каждого из файлов,
 * слейте его в одну строку и запишите в новый файл new.txt. Изначально этого файла не должно быть.
 */