<?php
/*
 * Проблема обратного слеша в PHP
 */

/* Задача
 * Дана строка: $str = 'a\\b c\\d e\\f';
 * Найдите в этой строке все подстроки по шаблону буква, обратный слеш, буква.
 */

$str = 'a\\b c\\d e\\f';
$res = preg_replace('#[a-z]\\\\[a-z]#','!',$str); // ! ! !

/* Задача 2
 * Дана строка: $str = 'a\\b c\\\\d e\\\\\\f';
 * Найдите в этой строке все подстроки по шаблону буква,
 * обратный слеш любое количество раз, буква.
 */

$str = 'a\\b c\\\\d e\\\\\\f';
$res = preg_replace('#\\\\*[a-z]#','!',$str); // !! !! !!