<?php

/*
 *  Задачи цикл for
 */

/* Задача 1
 * С помощью цикла for выведите на экран числа от 1 до 100.
 */

for ($i = 1; $i <= 100; $i++){
    echo $i;
}

echo "<br>";

/* Задача 2
 * С помощью цикла for выведите на экран числа от 11 до 33.
 */

for ($i = 11; $i <=33; $i++){
    echo $i;
}

echo "<br>";


/* Задача 3
 * С помощью цикла for выведите на экран четные числа в промежутке от 0 до 100.
 */
for ($k = 0; $k <= 100; $k = $k +2){
    echo $k;
}

echo "<br>";


/* Задача 4
 * С помощью цикла for выведите на экран нечетные числа в промежутке от 1 до 99.
 */

for ($z = 1; $z <= 99; $z = $z +2){
    echo $z;
}

echo "<br>";


/* Задача 5
 * С помощью цикла for выведите на экран числа от 100 до 0.
 */

for ($x = 100; $x >= 0; $x--){
    echo $x;
}