<?php

/*
 * Накопление результата в цикле PHP
 */

/* Задача 1
 * Найдите произведение целых чисел от 1 до 20.
 */

$result = 0;

for ($i = 1; $i <= 20; $i++){
    $result += $i;
}
echo $result;

echo "<br>";

/* Задача 2
 * Найдите сумму четных чисел от 2 до 100.
 */
$result = 0;

for ($i = 2; $i <= 100; $i+=2){
    $result += $i;
}
echo $result;

echo "<br>";

/* Задача 3
 * Найдите сумму нечетных чисел от 1 до 99.
 */

$result = 0;

for ($i = 1; $i < 99; $i+=2){
    $result += $i;
}
echo $result;