<?php
/*
 * Элемент textarea в PHP
 */

/* Задача 1
 * Попросите пользователя оставить отзыв на сайт.
 * После отправки формы выведите этот отзыв на экран.
 */

?>
<form action="" method="GET">
    <textarea name="test"></textarea>
    <input type="submit">
</form>

<?php echo $_GET['test'];?>

<?php
 /* Задача 2
  * Пусть в textarea вводится русский текст. После отправки формы выведите на экран транслит
  * этого текста. Сделайте так, чтобы содержимое формы сохранялось после отправки.
  */
?>

<form action="" method="POST">
    <textarea name="test" value="<?php if(isset($_POST['test'])) echo $_POST['test']?>"></textarea>
    <input type="submit">
</form>

<?php
$converter = array(
    'а' => 'a',    'б' => 'b',    'в' => 'v',    'г' => 'g',    'д' => 'd',
    'е' => 'e',    'ё' => 'e',    'ж' => 'zh',   'з' => 'z',    'и' => 'i',
    'й' => 'y',    'к' => 'k',    'л' => 'l',    'м' => 'm',    'н' => 'n',
    'о' => 'o',    'п' => 'p',    'р' => 'r',    'с' => 's',    'т' => 't',
    'у' => 'u',    'ф' => 'f',    'х' => 'h',    'ц' => 'c',    'ч' => 'ch',
    'ш' => 'sh',   'щ' => 'sch',  'ь' => '',     'ы' => 'y',    'ъ' => '',
    'э' => 'e',    'ю' => 'yu',   'я' => 'ya',

    'А' => 'A',    'Б' => 'B',    'В' => 'V',    'Г' => 'G',    'Д' => 'D',
    'Е' => 'E',    'Ё' => 'E',    'Ж' => 'Zh',   'З' => 'Z',    'И' => 'I',
    'Й' => 'Y',    'К' => 'K',    'Л' => 'L',    'М' => 'M',    'Н' => 'N',
    'О' => 'O',    'П' => 'P',    'Р' => 'R',    'С' => 'S',    'Т' => 'T',
    'У' => 'U',    'Ф' => 'F',    'Х' => 'H',    'Ц' => 'C',    'Ч' => 'Ch',
    'Ш' => 'Sh',   'Щ' => 'Sch',  'Ь' => '',     'Ы' => 'Y',    'Ъ' => '',
    'Э' => 'E',    'Ю' => 'Yu',   'Я' => 'Ya',
);
if (!empty($_POST['test'])){
    $_POST = strtr($_POST['test'], $converter);
    echo $_POST;
}
?>