<?php
/*
 * Поиск всех совпадений через регулярки на PHP
 */

/* Задача 1
 * Дана строка. Узнайте, сколько чисел в этой строке.
 */

$str = 'aba123 ababa123 asbab345 aba567';
echo preg_match_all('#\d#', $str); // 12

/* Задача 2
 * Дана строка с датами: $str = '2023-10-29 2024-11-30 2025-12-31';
 * Найдите все даты, отделив год, месяц и день в отдельные карманы.
 */

$str = '2023-10-29 2024-11-30 2025-12-31';
$res = '#([0-9]+-[0-9]+-[0-9]+)\s([0-9]+)-([0-9]+)-([0-9]+)\s([0-9]+)-([0-9]+)-([0-9]+)#';
preg_match_all($res,$str,$new);

/*
array(10) {
  [0]=>
  array(1) {
    [0]=>
    string(32) "2023-10-29 2024-11-30 2025-12-31"
  }
  [1]=>
  array(1) {
    [0]=>
    string(4) "2023"
  }
  [2]=>
  array(1) {
    [0]=>
    string(2) "10"
  }
  [3]=>
  array(1) {
    [0]=>
    string(2) "29"
  }
  [4]=>
  array(1) {
    [0]=>
    string(4) "2024"
  }
  [5]=>
  array(1) {
    [0]=>
    string(2) "11"
  }
  [6]=>
  array(1) {
    [0]=>
    string(2) "30"
  }
  [7]=>
  array(1) {
    [0]=>
    string(4) "2025"
  }
  [8]=>
  array(1) {
    [0]=>
    string(2) "12"
  }
  [9]=>
  array(1) {
    [0]=>
    string(2) "31"
  }
}
 */

echo "<br>";

/* Задача 3
 * Модифицируйте предыдущую задачу так, чтобы в первый подмассив попала первая дата с ее карманами,
 * во второй подмассив - вторая с ее карманами и так далее.
 */

$str = '2023-10-29 2024-11-30 2025-12-31';
$res = '#([0-9]+-[0-9]+-[0-9]+)\s([0-9]+-[0-9]+-[0-9]+)\s([0-9]+-[0-9]+-[0-9]+)#';
preg_match_all($res,$str,$new,PREG_SET_ORDER);

echo "<pre>";
var_dump($new);




