<?php
/*
 * Общий номер карманов в регулярках PHP
 */

/* Задача 1 :
 * Даны строки с датами, в которых год может изменяться от 1990 до 2099
 * Для каждой даты положите день в первый карман, месяц во второй,
 * а последние две цифры года - в третий.
 */

$arr = [
    '31-12-2025',
    '30-11-1995',
    '29-10-1990',
];
$reg = '#([0-9]+)-([0-9]+)-(?|20(\d\d)|19(\d\d))#';

foreach ($arr as $item) {
    $day = preg_match($reg, $item, $match);

    echo "<pre>";
    var_dump($match);
}

/*array(4)
{
  [0]=>
  string(10) "31-12-2025"
  [1]=>
  string(2) "31"
  [2]=>
  string(2) "12"
  [3]=>
  string(2) "25"
}

array(4) {
  [0]=>
  string(10) "30-11-1995"
  [1]=>
  string(2) "30"
  [2]=>
  string(2) "11"
  [3]=>
  string(2) "95"
}

array(4) {
  [0]=>
  string(10) "29-10-1990"
  [1]=>
  string(2) "29"
  [2]=>
  string(2) "10"
  [3]=>
  string(2) "90"
}
 */



